mikaelpatel/Cosa/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2013-2014, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
# 
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
# 
# You should have received a copy of the GNU Lesser General
# Public License along with this library; if not, write to the
# Free Software Foundation, Inc., 59 Temple Place, Suite 330,
# Boston, MA  02111-1307  USA
#
# @section Description
# The Cosa Arduino core boards definition file. 
#
# This file is part of the Arduino Che Cosa project.

##
# BREADBOARDS
##

# AVR:ATtiny84
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny84-8.name=Cosa Tiny (ATtiny84, 8 MHz internal clock)
attiny84-8.upload.using=arduino:arduinoisp
attiny84-8.upload.tool=arduino:arduinoisp
attiny84-8.upload.maximum_size=8192
attiny84-8.upload.maximum_data_size=512

attiny84-8.bootloader.tool=arduino:arduinoisp
attiny84-8.bootloader.low_fuses=0xe2
attiny84-8.bootloader.high_fuses=0xdf
attiny84-8.bootloader.extended_fuses=0xff

attiny84-8.build.mcu=attiny84
attiny84-8.build.f_cpu=8000000L
attiny84-8.build.board=BREADBOARD_ATTINYX4
attiny84-8.build.core=cosa

# AVR:ATtiny85
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny85-8.name=Cosa Tiny (ATtiny85, 8 MHz internal clock)
attiny85-8.upload.using=arduino:arduinoisp
attiny85-8.upload.tool=arduino:arduinoisp
attiny85-8.upload.maximum_size=8192
attiny85-8.upload.maximum_data_size=512

attiny85-8.bootloader.tool=arduino:arduinoisp
attiny85-8.bootloader.low_fuses=0xe2
attiny85-8.bootloader.high_fuses=0xdf
attiny85-8.bootloader.extended_fuses=0xff

attiny85-8.build.mcu=attiny85
attiny85-8.build.f_cpu=8000000L
attiny85-8.build.board=BREADBOARD_ATTINYX5
attiny85-8.build.core=cosa

# AVR:ATtiny861
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny861-8.name=Cosa Tiny (ATtiny861, 8 MHz internal clock)
attiny861-8.upload.using=arduino:arduinoisp
attiny861-8.upload.tool=arduino:arduinoisp
attiny861-8.upload.maximum_size=8192
attiny861-8.upload.maximum_data_size=512

attiny861-8.bootloader.tool=arduino:arduinoisp
attiny861-8.bootloader.low_fuses=0xe2
attiny861-8.bootloader.high_fuses=0xdf
attiny861-8.bootloader.extended_fuses=0x01

attiny861-8.build.mcu=attiny861
attiny861-8.build.f_cpu=8000000L
attiny861-8.build.board=BREADBOARD_ATTINYX61
attiny861-8.build.core=cosa

# AVR:ATmega328
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
atmega328-8.name=Cosa Arduino Basetta (ATmega328, 8 MHz internal clock)
atmega328-8.upload.using=arduino:arduinoisp
atmega328-8.upload.tool=arduino:arduinoisp
# atmega328-8.upload.protocol=usbasp
atmega328-8.upload.maximum_size=32256
atmega328-8.upload.speed=115200

atmega328-8.bootloader.tool=arduino:arduinoisp
atmega328-8.bootloader.low_fuses=0xE2
atmega328-8.bootloader.high_fuses=0xDE
atmega328-8.bootloader.extended_fuses=0xFD

atmega328-8.build.mcu=atmega328p
atmega328-8.build.f_cpu=8000000L
atmega328-8.build.board=BREADBOARD_ATMEGA328P
atmega328-8.build.core=cosa

# AVR:ATmega1284
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0xfc00). 
mighty.name=Cosa Arduino Mighty (ATmega1284/BOOT_1284P)
mighty.upload.tool=avrdude
mighty.upload.protocol=stk500v1
mighty.upload.maximum_size=129024
mighty.upload.maximum_data_size=16384
mighty.upload.speed=57600

mighty.bootloader.tool=avrdude
mighty.bootloader.low_fuses=0xff
mighty.bootloader.high_fuses=0xdc
mighty.bootloader.extended_fuses=0xfd

mighty.build.mcu=atmega1284p
mighty.build.f_cpu=16000000L
mighty.build.board=BREADBOARD_ATMEGA1284
mighty.build.core=cosa

# AVR:ATmega1284
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00). 
mighty-opt.name=Cosa Arduino Mighty (ATmega1284/Optiboot)
mighty-opt.upload.tool=avrdude
mighty-opt.upload.protocol=arduino
mighty-opt.upload.maximum_size=130048
mighty-opt.upload.maximum_data_size=16384
mighty-opt.upload.speed=115200

mighty-opt.bootloader.tool=avrdude
mighty-opt.bootloader.low_fuses=0xff
mighty-opt.bootloader.high_fuses=0xde
mighty-opt.bootloader.extended_fuses=0xfd

mighty-opt.build.mcu=atmega1284p
mighty-opt.build.f_cpu=16000000L
mighty-opt.build.board=BREADBOARD_ATMEGA1284
mighty-opt.build.core=cosa

##
# ARDUINO BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
uno.name=Cosa Arduino Uno (ATmega328/Optiboot)
uno.upload.tool=avrdude
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=ARDUINO_UNO
uno.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
duemilanove.name=Cosa Arduino Duemilanove (ATmega328/BOOT_168)
duemilanove.upload.tool=avrdude
duemilanove.upload.protocol=arduino
duemilanove.upload.maximum_size=30720
duemilanove.upload.maximum_data_size=2048
duemilanove.upload.speed=57600

duemilanove.bootloader.tool=avrdude
duemilanove.bootloader.low_fuses=0xff
duemilanove.bootloader.high_fuses=0xda
duemilanove.bootloader.extended_fuses=0x05

duemilanove.build.mcu=atmega328p
duemilanove.build.f_cpu=16000000L
duemilanove.build.board=ARDUINO_DUEMILANOVE
duemilanove.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
nano.name=Cosa Arduino Nano (ATmega328/BOOT_168)
nano.upload.tool=avrdude
nano.upload.protocol=arduino
nano.upload.maximum_size=30720
nano.upload.maximum_data_size=2048
nano.upload.speed=57600

nano.bootloader.tool=avrdude
nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xda
nano.bootloader.extended_fuses=0x05

nano.build.mcu=atmega328p
nano.build.f_cpu=16000000L
nano.build.core=cosa
nano.build.board=ARDUINO_NANO

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
lilypad.name=Cosa LilyPad Arduino (ATmega328/BOOT_168, 8 MHz)
lilypad.upload.tool=avrdude
lilypad.upload.protocol=arduino
lilypad.upload.maximum_size=30720
lilypad.upload.maximum_data_size=2048
lilypad.upload.speed=57600

lilypad.bootloader.tool=avrdude
lilypad.bootloader.low_fuses=0xff
lilypad.bootloader.high_fuses=0xda
lilypad.bootloader.extended_fuses=0x05

lilypad.build.mcu=atmega328p
lilypad.build.f_cpu=8000000L
lilypad.build.board=LILYPAD_ARDUINO
lilypad.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
pro-mini.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168)
pro-mini.upload.tool=avrdude
pro-mini.upload.protocol=arduino
pro-mini.upload.maximum_size=30720
pro-mini.upload.maximum_data_size=2048
pro-mini.upload.speed=57600

pro-mini.bootloader.tool=avrdude
pro-mini.bootloader.low_fuses=0xff
pro-mini.bootloader.high_fuses=0xda
pro-mini.bootloader.extended_fuses=0x05

pro-mini.build.mcu=atmega328p
pro-mini.build.f_cpu=16000000L
pro-mini.build.board=ARDUINO_PRO_MINI
pro-mini.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
pro-mini-8.name=Cosa Arduino Pro Mini (ATmega328/BOOT_168, 3.3V, 8 MHz)
pro-mini-8.upload.tool=avrdude
pro-mini-8.upload.protocol=arduino
pro-mini-8.upload.maximum_size=30720
pro-mini-8.upload.maximum_data_size=2048
pro-mini-8.upload.speed=57600

pro-mini-8.bootloader.tool=avrdude
pro-mini-8.bootloader.low_fuses=0xFF
pro-mini-8.bootloader.high_fuses=0xDA
pro-mini-8.bootloader.extended_fuses=0x05

pro-mini-8.build.mcu=atmega328p
pro-mini-8.build.f_cpu=8000000L
pro-mini-8.build.board=ARDUINO_PRO_MINI
pro-mini-8.build.core=cosa

# AVR:ATmega2560
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
mega.name=Cosa Arduino Mega (ATmega2560/STK500v2)
mega.upload.tool=avrdude
mega.upload.protocol=wiring
mega.upload.maximum_size=258048
mega.upload.maximum_data_size=8192
mega.upload.speed=115200

mega.bootloader.tool=avrdude
mega.bootloader.low_fuses=0xff
mega.bootloader.high_fuses=0xd8
mega.bootloader.extended_fuses=0xfd

mega.build.mcu=atmega2560
mega.build.f_cpu=16000000L
mega.build.board=ARDUINO_MEGA2560
mega.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
leonardo.name=Cosa Arduino Leonardo (ATmega32U4/Caterina)
leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.core=cosa
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=ARDUINO_LEONARDO
leonardo.build.extra_flags={build.usb_flags}

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
micro.name=Cosa Arduino Micro (ATmega32U4/Caterina)
micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=ARDUINO_MICRO
micro.build.core=cosa
micro.build.extra_flags={build.usb_flags}

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.0 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
lilypad-usb.name=Cosa LilyPad Arduino USB (ATmega32U4/Caterina, 8 MHz)
lilypad-usb.upload.tool=avrdude
lilypad-usb.upload.protocol=avr109
lilypad-usb.upload.maximum_size=28672
lilypad-usb.upload.maximum_data_size=2560
lilypad-usb.upload.speed=57600
lilypad-usb.upload.disable_flushing=true
lilypad-usb.upload.use_1200bps_touch=true
lilypad-usb.upload.wait_for_upload_port=true

lilypad-usb.bootloader.tool=avrdude
lilypad-usb.bootloader.low_fuses=0xff
lilypad-usb.bootloader.high_fuses=0xd8
lilypad-usb.bootloader.extended_fuses=0xce

lilypad-usb.build.mcu=atmega32u4
lilypad-usb.build.f_cpu=8000000L
lilypad-usb.build.vid=0x1B4F
lilypad-usb.build.pid=0x9208
lilypad-usb.usb_product="Arduino LilyPad USB"
lilypad-usb.build.board=LILYPAD_ARDUINO_USB
lilypad-usb.build.core=cosa
lilypad-usb.build.extra_flags={build.usb_flags}

##
# MICRODUINO CORE MODULES
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
microduino-core.name=Cosa Microduino-Core (ATmega328/Optiboot)
microduino-core.upload.tool=avrdude
microduino-core.upload.protocol=arduino
microduino-core.upload.maximum_size=32256
microduino-core.upload.maximum_data_size=2048
microduino-core.upload.speed=115200

microduino-core.bootloader.tool=avrdude
microduino-core.bootloader.low_fuses=0xff
microduino-core.bootloader.high_fuses=0xde
microduino-core.bootloader.extended_fuses=0x05

microduino-core.build.mcu=atmega328p
microduino-core.build.f_cpu=16000000L
microduino-core.build.board=MICRODUINO_CORE
microduino-core.build.core=cosa

# AVR:ATmega32U4
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.6 V. Serial program downloading enabled
# Boot Reset vector enable (2048 words, 0x3800). 
microduino-core32u4.name=Cosa Microduino-Core32u4 (ATmega32U4/Caterina)
microduino-core32u4.upload.tool=avrdude
microduino-core32u4.upload.protocol=avr109
microduino-core32u4.upload.maximum_size=28672
microduino-core32u4.upload.maximum_data_size=2560
microduino-core32u4.upload.speed=57600
microduino-core32u4.upload.disable_flushing=true
microduino-core32u4.upload.use_1200bps_touch=true
microduino-core32u4.upload.wait_for_upload_port=true

microduino-core32u4.bootloader.tool=avrdude
microduino-core32u4.bootloader.low_fuses=0xff
microduino-core32u4.bootloader.high_fuses=0xd8
microduino-core32u4.bootloader.extended_fuses=0xcb

microduino-core32u4.build.mcu=atmega32u4
microduino-core32u4.build.f_cpu=16000000L
microduino-core32u4.build.vid=0x2341
microduino-core32u4.build.pid=0x8036
microduino-core32u4.build.core=cosa
microduino-core32u4.build.usb_product="Microduino Core32u4"
microduino-core32u4.build.board=MICRODUINO_CORE32U4
microduino-core32u4.build.extra_flags={build.usb_flags}

# AVR:ATmega644P
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00). 
microduino-core-plus.name=Cosa Microduino-Core+ (ATmega644P/Optiboot)
microduino-core-plus.upload.tool=avrdude
microduino-core-plus.upload.protocol=arduino
microduino-core-plus.upload.maximum_size=64512
microduino-core-plus.upload.maximum_data_size=4096
microduino-core-plus.upload.speed=115200

microduino-core-plus.bootloader.tool=avrdude
microduino-core-plus.bootloader.low_fuses=0xff
microduino-core-plus.bootloader.high_fuses=0xde
microduino-core-plus.bootloader.extended_fuses=0xfd

microduino-core-plus.build.mcu=atmega644p
microduino-core-plus.build.f_cpu=16000000L
microduino-core-plus.build.board=MICRODUINO_CORE_PLUS
microduino-core-plus.build.core=cosa

##
# PINOCCIO BOARDS
##

# AVR:Pinoccio
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
pinoccio.name=Cosa Pinoccio Scout (ATmega256RFR2/STK500v2)
pinoccio.upload.tool=avrdude
pinoccio.upload.protocol=wiring
pinoccio.upload.maximum_size=253952
pinoccio.upload.maximum_data_size=32768
pinoccio.upload.speed=115200

pinoccio.bootloader.tool=avrdude
pinoccio.bootloader.low_fuses=0xff
pinoccio.bootloader.high_fuses=0xd0
pinoccio.bootloader.extended_fuses=0xfe

pinoccio.build.mcu=atmega256rfr2
pinoccio.build.f_cpu=16000000L
pinoccio.build.board=PINOCCIO_SCOUT
pinoccio.build.core=cosa

